IDEA StatiCa Open Model
RebarShape.EndHook Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets or sets the end rebar hook.
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public RebarHookBase EndHook { get; set; }
Public Property EndHook As RebarHookBase
	Get
	Set
public:
property RebarHookBase^ EndHook {
	RebarHookBase^ get ();
	void set (RebarHookBase^ value);
}
Property Value
Type: RebarHookBase
See Also
Reference
RebarShape Class
IdeaRS.OpenModel.Model Namespace